Rhino.Inside.Revit API
GeometryEncoder.ToSolid Method (Extrusion)
 Converts the specified Rhino.Geometry.Extrusion to an equivalent of Autodesk.Revit.DB.Solid.
 Namespace: RhinoInside.Revit.Convert.Geometry
 Assembly: RhinoInside.Revit (in RhinoInside.Revit.dll) Version: 1.7.8130
Syntax
public static Autodesk.Revit.DB.Solid ToSolid(
	this Rhino.Geometry.Extrusion extrusion
)
@staticmethod
def ToSolid(
	extrusion: Rhino.Geometry.Extrusion
) -> Autodesk.Revit.DB.Solid
Parameters
extrusion
Type: Rhino.Geometry.Extrusion
Rhino extrusion to convert.
Return Value
Type: Autodesk.Revit.DB.Solid
Revit solid that is equivalent to the provided Rhino extrusion.
Usage Note
In Visual Basic and C#, you can call this method as an instance method on any object of type Rhino.Geometry.Extrusion. When you use instance method syntax to call this method, omit the first parameter. For more information, see Extension Methods (Visual Basic) or Extension Methods (C# Programming Guide).
Examples
 Using ToSolid(Extrusion) as extension method:
using DB = Autodesk.Revit.DB;
using RhinoInside.Revit.Convert.Geometry;
DB.Solid revitSolid = rhinoExtrusion.ToSolid();
import clr
clr.AddReference("RevitAPI")
clr.AddReference("RhinoInside.Revit")
import Autodesk.Revit.DB as DB
import RhinoInside.Revit.Convert.Geometry
clr.ImportExtensions(RhinoInside.Revit.Convert.Geometry)
revit_solid = rhino_extrusion.ToSolid()    # type: DB.Solid
 Using ToSolid(Extrusion) as static method:
using DB = Autodesk.Revit.DB;
using RhinoInside.Revit.Convert.Geometry;
DB.Solid revitSolid = GeometryEncoder.ToSolid(rhinoExtrusion);
import clr
clr.AddReference("RevitAPI")
clr.AddReference("RhinoInside.Revit")
import Autodesk.Revit.DB as DB
import RhinoInside.Revit.Convert.Geometry.GeometryEncoder as GE
revit_solid = GE.ToSolid(rhino_extrusion)    # type: DB.Solid
See Also
Reference
GeometryEncoder Class
ToSolid Overload
RhinoInside.Revit.Convert.Geometry Namespace